app/controllers/messages_controller.rb

INSERT INTO "messages" ("body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "message"], ["user_id", 1], ["created_at", "2020-01-02 10:43:10.459260"], ["updated_at", "2020-01-02 10:43:10.459260"]]
---
  def create
    message = current_user.messages.build(message_params)
    if message.save